tap "basecamp/tap"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"
brew "webp"
brew "bottom"
brew "btop"
brew "caddy"
brew "cairo"
brew "docker"
brew "doctl"
brew "openssl@3"
brew "exiftool"
brew "fd"
brew "gmp"
brew "unbound"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "hledger"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "libyaml"
brew "python@3.13"
brew "utf8proc", args: ["HEAD"]
brew "neovim"
brew "openblas"
brew "numpy"
brew "oha"
brew "ollama", restart_service: :changed
brew "openvino"
brew "pdfcpu"
brew "pipx"
brew "poppler"
brew "postgresql@14"
brew "powershell", link: false
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sevenzip"
brew "starship"
brew "tabiew"
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "basecamp/tap/basecamp-cli"
cask "canva"
cask "cmux"
cask "daisydisk"
cask "downie"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "hey-desktop"
cask "hiddenbar"
cask "ia-presenter"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "kekaexternalhelper"
cask "permute"
cask "pieces"
cask "pieces-os"
cask "postman"
cask "powershell"
cask "radio-silence"
cask "raycast"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"
