tap "oven-sh/bun"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Vector graphics library with cross-device output support
brew "cairo"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line tool for DigitalOcean
brew "doctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# All-In-One Toolkit for Working Remotely
cask "basecamp"
# Design tool
cask "canva"
# Disk space visualiser
cask "daisydisk"
# Downloads videos from different websites
cask "downie"
# Collaborative team software
cask "figma"
cask "font-symbols-only-nerd-font"
# Access the HEY email service
cask "hey"
# Utility to hide menu bar items
cask "hiddenbar"
# Create presentation slides from a Markdown document
cask "ia-presenter"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Converts and edits video, audio or image files
cask "permute"
# Colour picker for colours onscreen
cask "pika"
# Collaboration platform for API development
cask "postman"
# Network monitor and firewall
cask "radio-silence"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
